The family no longer matches the properties for the Circuit. Disconnect the family from the Circuit?
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FamilyMismatchCircuitDisconnected { get; }
  Visual Basic
Public Shared ReadOnly Property FamilyMismatchCircuitDisconnected As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FamilyMismatchCircuitDisconnected {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ElectricityFailures Class
  Autodesk.Revit.DB Namespace